gonervirt/esp32_wifi_test/src/main.cpp
/*
 * MIT License
 * 
 * Copyright (c) 2024 Sebastian
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

/**
 * @file main.cpp
 * @brief ESP32 WiFi Test Application
 * 
 * This application configures the ESP32 as an Access Point (AP) and hosts a 
 * web server. The web interface provides diagnostic tools to test the WiFi 
 * module, including scanning for nearby networks and displaying system status.
 * 
 * Features:
 * - Access Point Mode (SSID: ESP32_WiFi_Test)
 * - Modern, responsive Web Interface
 * - AJAX/Fetch API for non-blocking UI updates
 * - WiFi Scanning capability
 * 
 * @version 1.0.0
 */

#include <Arduino.h>
#ifdef ESP32
#include <WiFi.h>
#include <WebServer.h>
#include <esp_wifi.h>
#else
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
extern "C" {
#include "user_interface.h"
}
#endif
#include <lwip/stats.h>
#include <DNSServer.h>

// -------------------------------------------------------------------------
// Configuration Constants
// -------------------------------------------------------------------------
const char* AP_SSID = "ESP32_WiFi_Test";
const char* AP_PASS = "12345678"; // Min 8 chars for WPA2
const int   WEB_PORT = 80;

// -------------------------------------------------------------------------
// Global Objects
// -------------------------------------------------------------------------
#ifdef ESP32
WebServer server(WEB_PORT);
#else
ESP8266WebServer server(WEB_PORT);
// ESP8266 Event Handlers
WiFiEventHandler stationDisconnectHandler;
WiFiEventHandler softAPDisconnectHandler;
#endif
DNSServer dnsServer;
volatile uint32_t disconnect_count = 0;

// -------------------------------------------------------------------------
// Web Content (HTML/CSS/JS)
// -------------------------------------------------------------------------
// Stored in PROGMEM to save RAM
const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32 WiFi Diagnostic Tool</title>
    <style>
        :root {
            --primary-color: #2563eb;
            --bg-color: #f3f4f6;
            --card-bg: #ffffff;
            --text-color: #1f2937;
            --border-color: #e5e7eb;
        }
        body {
            font-family: 'Segoe UI', Roboto, Helvetica, Arial, sans-serif;
            background-color: var(--bg-color);
            color: var(--text-color);
            margin: 0;
            padding: 20px;
            line-height: 1.5;
        }
        .container {
            max-width: 800px;
            margin: 0 auto;
            background: var(--card-bg);
            padding: 2rem;
            border-radius: 12px;
            box-shadow: 0 4px 6px -1px rgba(0, 0, 0, 0.1);
        }
        h1 { color: var(--primary-color); margin-top: 0; }
        .card {
            background: #f8fafc;
            border: 1px solid var(--border-color);
            border-radius: 8px;
            padding: 1rem;
            margin-bottom: 1.5rem;
        }
        .grid {
            display: grid;
            grid-template-columns: repeat(auto-fit, minmax(200px, 1fr));
            gap: 1rem;
        }
        .stat-item { display: flex; flex-direction: column; }
        .stat-label { font-size: 0.875rem; color: #6b7280; }
        .stat-value { font-size: 1.125rem; font-weight: 600; }
        
        button {
            background-color: var(--primary-color);
            color: white;
            border: none;
            padding: 0.75rem 1.5rem;
            border-radius: 6px;
            font-weight: 600;
            cursor: pointer;
            transition: background-color 0.2s;
        }
        button:hover { background-color: #1d4ed8; }
        button:disabled { background-color: #9ca3af; cursor: not-allowed; }
        
        table { width: 100%; border-collapse: collapse; margin-top: 1rem; }
        th, td { text-align: left; padding: 0.75rem; border-bottom: 1px solid var(--border-color); }
        th { background-color: #f1f5f9; font-weight: 600; }
        tr:hover { background-color: #f8fafc; }
        
        .badge {
            padding: 0.25rem 0.5rem;
            border-radius: 9999px;
            font-size: 0.75rem;
            font-weight: 500;
        }
        .badge-good { background-color: #dcfce7; color: #166534; }
        .badge-weak { background-color: #fee2e2; color: #991b1b; }
    </style>
</head>
<body>
    <div class="container">
        <h1>WiFi Diagnostic Tool</h1>
        
        <div class="card">
            <div class="grid">
                <div class="stat-item">
                    <span class="stat-label">AP IP Address</span>
                    <span class="stat-value" id="ip">Loading...</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">MAC Address</span>
                    <span class="stat-value" id="mac">Loading...</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Uptime</span>
                    <span class="stat-value" id="uptime">0s</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Free Heap</span>
                    <span class="stat-value" id="heap">0 KB</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">TX Power</span>
                    <span class="stat-value" id="txpower">0 dBm</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">CPU Freq</span>
                    <span class="stat-value" id="cpu_freq">0 MHz</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">TCP Retries</span>
                    <span class="stat-value" id="tcprexmit">0</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Disconnects</span>
                    <span class="stat-value" id="disconnects">0</span>
                </div>
            </div>
        </div>

        <div class="card">
            <h2>Hardware Details</h2>
            <div class="grid">
                <div class="stat-item">
                    <span class="stat-label">Chip Model</span>
                    <span class="stat-value" id="chip_model">Loading...</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Revision</span>
                    <span class="stat-value" id="chip_rev">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Features</span>
                    <span class="stat-value" id="features" style="font-size:0.8rem">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Cores</span>
                    <span class="stat-value" id="cores">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Flash Size</span>
                    <span class="stat-value" id="flash_size">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Total RAM</span>
                    <span class="stat-value" id="ram_total">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">PSRAM</span>
                    <span class="stat-value" id="psram_size">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">SDK Version</span>
                    <span class="stat-value" id="sdk_ver" style="font-size:0.8rem">-</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Build Date</span>
                    <span class="stat-value" id="fw_date" style="font-size:0.8rem">-</span>
                </div>
            </div>
        </div>

        <div class="card">
            <h2>Diagnostics</h2>
            <div class="grid">
                <div class="stat-item">
                    <span class="stat-label">Connected Clients</span>
                    <span class="stat-value" id="clientCount">0</span>
                </div>
                <div class="stat-item">
                    <span class="stat-label">Signal Strength (RSSI)</span>
                    <span class="stat-value" id="clientRssi">--</span>
                </div>
            </div>
            <div style="margin-top: 1rem; display: flex; gap: 10px; flex-wrap: wrap;">
                <button onclick="runPingTest()" id="btnPing">Test Latency</button>
                <button onclick="runSpeedTest()" id="btnSpeed">Test Throughput</button>
                <button onclick="runUploadTest()" id="btnUpload">Test Upload</button>
            </div>
            <div id="testResults" style="margin-top: 1rem; font-family: monospace; white-space: pre-wrap; background: #eee; padding: 10px; border-radius: 6px; display: none;"></div>
        </div>

        <div class="controls">
            <button id="scanBtn" onclick="scanNetworks()">Scan Nearby Networks</button>
            <span id="statusMsg" style="margin-left: 10px; color: #6b7280;"></span>
        </div>

        <div style="overflow-x: auto;">
            <table id="wifiTable">
                <thead>
                    <tr>
                        <th>SSID</th>
                        <th>RSSI</th>
                        <th>Channel</th>
                        <th>Security</th>
                    </tr>
                </thead>
                <tbody id="wifiList">
                    <tr><td colspan="4" style="text-align:center">Ready to scan</td></tr>
                </tbody>
            </table>
        </div>
    </div>

    <script>
        function updateStatus() {
            fetch('/api/status')
                .then(res => res.json())
                .then(data => {
                    document.getElementById('ip').textContent = data.ip;
                    document.getElementById('mac').textContent = data.mac;
                    document.getElementById('uptime').textContent = formatUptime(data.uptime);
                    document.getElementById('heap').textContent = (data.heap / 1024).toFixed(1) + ' KB';
                    document.getElementById('txpower').textContent = data.tx_power + ' dBm';
                    document.getElementById('cpu_freq').textContent = data.cpu_freq + ' MHz';
                    document.getElementById('tcprexmit').textContent = data.tcp_rexmit;
                    document.getElementById('disconnects').textContent = data.disconnects;
                    
                    document.getElementById('chip_model').textContent = data.chip_model;
                    document.getElementById('chip_rev').textContent = 'v' + data.chip_rev;
                    document.getElementById('features').textContent = data.features;
                    document.getElementById('cores').textContent = data.cores;
                    document.getElementById('flash_size').textContent = (data.flash_size / (1024*1024)).toFixed(2) + ' MB';
                    document.getElementById('ram_total').textContent = data.ram_total > 0 ? (data.ram_total / 1024).toFixed(1) + ' KB' : 'N/A';
                    document.getElementById('psram_size').textContent = data.psram_size > 0 ? (data.psram_size / (1024*1024)).toFixed(2) + ' MB' : 'None';
                    document.getElementById('sdk_ver').textContent = data.sdk_ver;
                    document.getElementById('fw_date').textContent = data.fw_date;
                })
                .catch(e => console.error('Status error:', e));

            fetch('/api/clients')
                .then(res => res.json())
                .then(data => {
                    document.getElementById('clientCount').textContent = data.length;
                    if(data.length > 0) {
                        // Show RSSI of the first connected client (likely the tester)
                        document.getElementById('clientRssi').textContent = data[0].rssi + ' dBm';
                    } else {
                        document.getElementById('clientRssi').textContent = '--';
                    }
                })
                .catch(e => console.error('Clients error:', e));
        }

