gonervirt/esp32_wifi_test/src/main.cpp
        function formatUptime(seconds) {
            const h = Math.floor(seconds / 3600);
            const m = Math.floor((seconds % 3600) / 60);
            const s = seconds % 60;
            return `${h}h ${m}m ${s}s`;
        }

        function scanNetworks() {
            const btn = document.getElementById('scanBtn');
            const tbody = document.getElementById('wifiList');
            const msg = document.getElementById('statusMsg');
            
            btn.disabled = true;
            btn.textContent = 'Scanning...';
            msg.textContent = 'Please wait...';
            tbody.innerHTML = '<tr><td colspan="4" style="text-align:center">Scanning in progress...</td></tr>';

            fetch('/api/scan')
                .then(res => res.json())
                .then(data => {
                    tbody.innerHTML = '';
                    if (data.length === 0) {
                        tbody.innerHTML = '<tr><td colspan="4" style="text-align:center">No networks found</td></tr>';
                    } else {
                        data.forEach(net => {
                            const rssiClass = net.rssi > -70 ? 'badge-good' : 'badge-weak';
                            const row = `<tr>
                                <td><strong>${net.ssid}</strong></td>
                                <td><span class="badge ${rssiClass}">${net.rssi} dBm</span></td>
                                <td>${net.channel}</td>
                                <td>${net.auth}</td>
                            </tr>`;
                            tbody.innerHTML += row;
                        });
                    }
                    msg.textContent = `Found ${data.length} networks`;
                })
                .catch(e => {
                    console.error('Scan error:', e);
                    tbody.innerHTML = '<tr><td colspan="4" style="text-align:center; color:red">Scan failed</td></tr>';
                    msg.textContent = 'Error occurred';
                })
                .finally(() => {
                    btn.disabled = false;
                    btn.textContent = 'Scan Nearby Networks';
                });
        }

        async function runPingTest() {
            const btn = document.getElementById('btnPing');
            const out = document.getElementById('testResults');
            btn.disabled = true;
            out.style.display = 'block';
            out.textContent = 'Running Latency Test (20 packets)...\n';
            
            let times = [];
            let lost = 0;
            const count = 20;

            for(let i=0; i<count; i++) {
                const start = performance.now();
                try {
                    await fetch('/api/ping', {cache: "no-store"});
                    const rtt = performance.now() - start;
                    times.push(rtt);
                    out.textContent += `Seq=${i+1}: ${rtt.toFixed(2)} ms\n`;
                } catch(e) {
                    lost++;
                    out.textContent += `Seq=${i+1}: LOST\n`;
                }
                // Small delay to prevent flooding
                await new Promise(r => setTimeout(r, 100));
            }

            if (times.length > 0) {
                const avg = times.reduce((a, b) => a + b, 0) / times.length;
                const min = Math.min(...times);
                const max = Math.max(...times);
                out.textContent += `\n--- Results ---\nPackets: ${count}, Lost: ${lost} (${(lost/count*100).toFixed(1)}%)\nRTT Min/Avg/Max: ${min.toFixed(2)} / ${avg.toFixed(2)} / ${max.toFixed(2)} ms`;
            } else {
                out.textContent += `\nAll packets lost.`;
            }
            btn.disabled = false;
        }

        async function runSpeedTest() {
            const btn = document.getElementById('btnSpeed');
            const out = document.getElementById('testResults');
            btn.disabled = true;
            out.style.display = 'block';
            out.textContent = 'Running Download Speed Test (1 MB)...\n';

            const sizeBytes = 1024 * 1024; // 1MB
            const start = performance.now();
            
            try {
                const res = await fetch('/api/download?size=' + sizeBytes);
                const blob = await res.blob(); // Read body
                const durationSec = (performance.now() - start) / 1000;
                const bits = sizeBytes * 8;
                const mbps = (bits / durationSec) / (1024 * 1024);
                
                out.textContent += `Transferred: ${(sizeBytes/1024).toFixed(0)} KB\nTime: ${durationSec.toFixed(2)} s\nSpeed: ${mbps.toFixed(2)} Mbps`;
            } catch(e) {
                out.textContent += `Error: ${e.message}`;
            }
            btn.disabled = false;
        }

        async function runUploadTest() {
            const btn = document.getElementById('btnUpload');
            const out = document.getElementById('testResults');
            btn.disabled = true;
            out.style.display = 'block';
            out.textContent = 'Running Upload Speed Test (1 MB)...\n';

            const sizeBytes = 1024 * 1024; // 1MB
            const data = new Uint8Array(sizeBytes).fill(0xAA);
            const blob = new Blob([data]);
            const formData = new FormData();
            formData.append("file", blob, "test.bin");

            const start = performance.now();
            try {
                await fetch('/api/upload', { method: 'POST', body: formData });
                const durationSec = (performance.now() - start) / 1000;
                const bits = sizeBytes * 8;
                const mbps = (bits / durationSec) / (1024 * 1024);
                out.textContent += `Transferred: ${(sizeBytes/1024).toFixed(0)} KB\nTime: ${durationSec.toFixed(2)} s\nSpeed: ${mbps.toFixed(2)} Mbps`;
            } catch(e) {
                out.textContent += `Error: ${e.message}`;
            }
            btn.disabled = false;
        }

        // Initial load
        updateStatus();
        // Poll status every 2 seconds
        setInterval(updateStatus, 2000);
    </script>
</body>
</html>
)rawliteral";

// -------------------------------------------------------------------------
// Helper Functions
// -------------------------------------------------------------------------

/**
 * @brief Convert WiFi encryption type to string
 */
String translateEncryptionType(uint8_t encryptionType) {
#ifdef ESP32
    switch (encryptionType) {
        case WIFI_AUTH_OPEN: return "Open";
        case WIFI_AUTH_WEP: return "WEP";
        case WIFI_AUTH_WPA_PSK: return "WPA_PSK";
        case WIFI_AUTH_WPA2_PSK: return "WPA2_PSK";
        case WIFI_AUTH_WPA_WPA2_PSK: return "WPA_WPA2_PSK";
        case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2_ENTERPRISE";
        case WIFI_AUTH_WPA3_PSK: return "WPA3_PSK";
        default: return "Unknown";
    }
#else
    switch (encryptionType) {
        case ENC_TYPE_NONE: return "Open";
        case ENC_TYPE_WEP: return "WEP";
        case ENC_TYPE_TKIP: return "WPA_PSK";
        case ENC_TYPE_CCMP: return "WPA2_PSK";
        case ENC_TYPE_AUTO: return "Auto";
        default: return "Unknown";
    }
#endif
}

/**
 * @brief WiFi Event Handler
 * Tracks disconnections to monitor stability
 */
#ifdef ESP32
void onWiFiEvent(WiFiEvent_t event) {
    if (event == ARDUINO_EVENT_WIFI_AP_STADISCONNECTED || event == ARDUINO_EVENT_WIFI_STA_DISCONNECTED) {
        disconnect_count++;
    }
}
#else
void onStationDisconnected(const WiFiEventStationModeDisconnected& evt) { disconnect_count++; }
void onSoftAPDisconnected(const WiFiEventSoftAPModeStationDisconnected& evt) { disconnect_count++; }
#endif

// -------------------------------------------------------------------------
// Request Handlers
// -------------------------------------------------------------------------

/**
 * @brief Serve the main HTML page
 */
void handleRoot() {
    server.send(200, "text/html", index_html);
}

/**
 * @brief API Endpoint: Get System Status
 * Returns JSON: { "ip": "...", "mac": "...", "uptime": 123 }
 */
void handleStatus() {
    String json = "{";
    json += "\"ip\":\"" + WiFi.softAPIP().toString() + "\",";
    json += "\"mac\":\"" + WiFi.macAddress() + "\",";
    json += "\"uptime\":" + String(millis() / 1000) + ",";
    json += "\"heap\":" + String(ESP.getFreeHeap()) + ",";

#ifdef ESP32
    int8_t power = 0;
    esp_wifi_get_max_tx_power(&power);
    json += "\"tx_power\":" + String(power * 0.25) + ",";
#else
    json += "\"tx_power\":0,";
#endif
    json += "\"cpu_freq\":" + String(ESP.getCpuFreqMHz());

#ifdef ESP32
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    String features = "";
    if (chip_info.features & CHIP_FEATURE_EMB_FLASH) features += "EmbFlash, ";
    if (chip_info.features & CHIP_FEATURE_WIFI_BGN) features += "WiFi-BGN, ";
    if (chip_info.features & CHIP_FEATURE_BLE) features += "BLE, ";
    if (chip_info.features & CHIP_FEATURE_BT) features += "BT, ";
    if (chip_info.features & CHIP_FEATURE_EMB_PSRAM) features += "EmbPSRAM, ";
    if (features.length() > 2) features = features.substring(0, features.length() - 2);

    json += ",\"chip_model\":\"" + String(ESP.getChipModel()) + " (revision v" + String(chip_info.revision) + ")\"";
    json += ",\"chip_rev\":" + String(chip_info.revision);
    json += ",\"features\":\"" + features + "\"";
    json += ",\"cores\":" + String(ESP.getChipCores());
    json += ",\"ram_total\":" + String(ESP.getHeapSize());
    json += ",\"psram_size\":" + String(ESP.getPsramSize());
#else
    json += ",\"chip_model\":\"ESP8266\"";
    json += ",\"chip_rev\":0";
    json += ",\"features\":\"WiFi\"";
    json += ",\"cores\":1";
    json += ",\"ram_total\":0";
    json += ",\"psram_size\":0";
#endif
    json += ",\"flash_size\":" + String(ESP.getFlashChipSize());
    json += ",\"sdk_ver\":\"" + String(ESP.getSdkVersion()) + "\"";
    json += ",\"fw_date\":\"" + String(__DATE__) + " " + String(__TIME__) + "\"";
    
    #if LWIP_STATS && LWIP_TCP
    json += ",\"tcp_rexmit\":" + String(lwip_stats.tcp.rexmit);
    #endif
    json += ",\"disconnects\":" + String(disconnect_count);
    json += "}";
    server.send(200, "application/json", json);
}

/**
 * @brief API Endpoint: Scan WiFi Networks
 * Performs a blocking scan and returns JSON array of networks
 */
void handleScan() {
    // Perform scan
    int n = WiFi.scanNetworks();
    
    String json = "[";
    for (int i = 0; i < n; ++i) {
        if (i > 0) json += ",";
        json += "{";
        json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
        json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
        json += "\"channel\":" + String(WiFi.channel(i)) + ",";
        json += "\"auth\":\"" + translateEncryptionType(WiFi.encryptionType(i)) + "\"";
        json += "}";
    }
    json += "]";
    
    server.send(200, "application/json", json);
    WiFi.scanDelete(); // Clean up RAM
}

/**
 * @brief API Endpoint: Ping
 * Used for latency testing. Returns simple timestamp.
 */
void handlePing() {
    server.send(200, "text/plain", String(millis()));
}

/**
 * @brief API Endpoint: Download Test
 * Sends a stream of dummy data to test throughput.
 * Query Param: size (bytes), default 1MB
 */
void handleDownload() {
    size_t size = 1024 * 1024; // Default 1MB
    if (server.hasArg("size")) {
        size = server.arg("size").toInt();
    }

    // Send headers
    server.setContentLength(size);
    server.send(200, "application/octet-stream", "");

    // Send data in chunks
    uint8_t buf[4096]; // Use a larger buffer (4K) for better performance
    memset(buf, 0xAA, sizeof(buf)); 
    
    size_t sent = 0;
    WiFiClient client = server.client();
    client.setNoDelay(true); // Disable Nagle Algorithm for lower latency
    
    while (sent < size && client.connected()) {
        size_t toSend = (size - sent) > sizeof(buf) ? sizeof(buf) : (size - sent);
        
