gonervirt/esp32_wifi_test/src/main.cpp
        // Capture actual bytes written. If buffer is full, this returns 0.
        size_t written = client.write(buf, toSend);
        
        if (written > 0) {
            sent += written;
        } else {
            // Buffer is full, give the LwIP stack a moment to drain
            delay(1);
        }
    }
}

/**
 * @brief API Endpoint: Upload Test
 * Receives data to test upload throughput.
 */
void handleUpload() {
    server.send(200, "text/plain", "OK");
}

/**
 * @brief API Endpoint: Get Connected Clients (AP Mode)
 * Returns JSON array of connected stations with RSSI.
 */
void handleClients() {
#ifdef ESP32
    wifi_sta_list_t wifi_sta_list;
    esp_wifi_ap_get_sta_list(&wifi_sta_list);

    String json = "[";
    for (int i = 0; i < wifi_sta_list.num; i++) {
        if (i > 0) json += ",";
        json += "{";
        
        // Format MAC
        char macStr[18];
        uint8_t *mac = wifi_sta_list.sta[i].mac;
        sprintf(macStr, "%02X:%02X:%02X:%02X:%02X:%02X", 
                mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        
        json += "\"mac\":\"" + String(macStr) + "\",";
        json += "\"rssi\":" + String(wifi_sta_list.sta[i].rssi);
        json += "}";
    }
    json += "]";
#else
    struct station_info *stat_info = wifi_softap_get_station_info();
    String json = "[";
    while (stat_info != NULL) {
        if (json.length() > 1) json += ",";
        json += "{";
        char macStr[18];
        sprintf(macStr, "%02X:%02X:%02X:%02X:%02X:%02X", 
                stat_info->bssid[0], stat_info->bssid[1], stat_info->bssid[2], 
                stat_info->bssid[3], stat_info->bssid[4], stat_info->bssid[5]);
        json += "\"mac\":\"" + String(macStr) + "\",";
        json += "\"rssi\":0"; // RSSI not available in standard AP mode on ESP8266
        json += "}";
        stat_info = STAILQ_NEXT(stat_info, next);
    }
    wifi_softap_free_station_info();
    json += "]";
#endif
    server.send(200, "application/json", json);
}

/**
 * @brief Handle 404 errors
 */
void handleNotFound() {
    if (server.hostHeader() != WiFi.softAPIP().toString()) {
        server.sendHeader("Location", String("http://") + WiFi.softAPIP().toString(), true);
        server.send(302, "text/plain", "");
    } else {
        server.send(404, "text/plain", "404: Not Found");
    }
}

// -------------------------------------------------------------------------
// Main Setup & Loop
// -------------------------------------------------------------------------

void setup() {
    // Initialize Serial for debugging
    Serial.begin(115200);
    delay(1000);
    Serial.println("\n\n--- ESP32 WiFi Tester Starting ---");

    // Register Event Handler
#ifdef ESP32
    WiFi.onEvent(onWiFiEvent);
#else
    stationDisconnectHandler = WiFi.onStationModeDisconnected(onStationDisconnected);
    softAPDisconnectHandler = WiFi.onSoftAPModeStationDisconnected(onSoftAPDisconnected);
#endif

    // Set WiFi Mode to AP_STA (Access Point + Station)
    // Station mode is required for scanning to work properly while AP is active
    WiFi.mode(WIFI_AP_STA);

    // Disable WiFi Power Save Mode to maximize throughput
#ifdef ESP32
    WiFi.setSleep(false);
#else
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
#endif

    // Configure Access Point
    Serial.print("Setting up Access Point... ");
    if (WiFi.softAP(AP_SSID, AP_PASS)) {
        Serial.println("Success");
        Serial.print("AP IP Address: ");
        Serial.println(WiFi.softAPIP());
        Serial.print("SSID: ");
        Serial.println(AP_SSID);
    } else {
        Serial.println("Failed!");
    }

    // Start DNS Server for Captive Portal (redirects all domains to this IP)
    dnsServer.start(53, "*", WiFi.softAPIP());

    // Setup Web Server Routes
    server.on("/", HTTP_GET, handleRoot);
    server.on("/api/status", HTTP_GET, handleStatus);
    server.on("/api/scan", HTTP_GET, handleScan);
    server.on("/api/ping", HTTP_GET, handlePing);
    server.on("/api/download", HTTP_GET, handleDownload);
    server.on("/api/upload", HTTP_POST, handleUpload, []() { server.upload(); });
    server.on("/api/clients", HTTP_GET, handleClients);
    server.onNotFound(handleNotFound);

    // Start Server
    server.begin();
    Serial.println("HTTP server started");
}

void loop() {
    // Process DNS requests
    dnsServer.processNextRequest();

    // Handle incoming client requests
    server.handleClient();
    
    // Add a small delay to prevent CPU hogging if needed, 
    // though handleClient is usually sufficient.
    delay(2); 
}